---
type: DeleteWorksetSettings
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# DeleteWorksetSettings

`Autodesk.Revit.DB.DeleteWorksetSettings` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DeleteWorksetSettings | — | `` |
| Constructor | DeleteWorksetSettings | 2022.1 | `public DeleteWorksetSettings ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DeleteWorksetOption | 2022.1 | `public DeleteWorksetOption DeleteWorksetOption { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | WorksetId | 2022.1 | `public WorksetId WorksetId { get ; set ; }` |